Revit 2024 API
Panel.Lockable Property
This property is used to know whether a panel can be locked.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool Lockable { get; }
Visual Basic
Public ReadOnly Property Lockable As Boolean
	Get
Visual C++
public:
property bool Lockable {
	bool get ();
}
Remarks
If the panel can be locked, return true, else false.
See Also
Panel Class
Autodesk.Revit.DB Namespace